// *********************************** Home Work 20.10.2023 ***************************************

//  ----------------------------------------- Task 64 ---------------------------------------------

// // Задача 64: Задайте значение N. Напишите программу, которая выведет все 
// // натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
// // N = 5 -> "5, 4, 3, 2, 1"
// // N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

// void Numbers (int n)
// {
//     if (n > 0) 
//     { 
//         System.Console.Write($"{n}, ");
//         Numbers(n-1);
//     }
// }

// Numbers (8);

// ----------------------------------------- Task 66 -------------------------------------------------

// // Задача 66: Задайте значения M и N. Напишите программу, 
// // которая найдёт сумму натуральных элементов в промежутке от M до N.
// // M = 1; N = 15 -> 120
// // M = 4; N = 8. -> 30

// int SumNatur (int m, int n)
// {
//     if (n > m)
//     {
//         int sum = SumNatur((m+1), n) + m;
//         return sum;
//     }
//     return n;
// }

// int sum = SumNatur(1, 15);
// Console.Write(sum);

// --------------------------------------------- Task 68 -------------------------------------------

// // Задача 68: Напишите программу вычисления функции Аккермана с 
// // помощью рекурсии. Даны два неотрицательных числа m и n.
// // m = 2, n = 3 -> A(m,n) = 9
// // m = 3, n = 2 -> A(m,n) = 29

// int RecursAckerman (int m, int n){
//     if (m == 0) return n + 1;
//     else if (n == 0) return RecursAckerman(m - 1, 1);
//     else return RecursAckerman(m - 1, RecursAckerman(m, n - 1)); 
// }

// int m = 2;
// int n = 3;
// Console.Write(RecursAckerman(m, n));